Revit 2023 API
ScheduleField Methods
The ScheduleField type exposes the following members.
Methods
Name | Description
CanDisplayMinMax
 Indicates if this field can display minimum and maximum values.
CanTotal
 Indicates if totals can be enabled for this field.
CanTotalByAssemblyType
 Indicates if totals by assembly type can be enabled for this field.
CreatesCircularReferences
 Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCombinedParameters
 Gets this field's combine parameter array if applicable
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetName
 Gets the name of the field.
GetSchedulableField
 Gets a SchedulableField object representing this field.
GetSpecTypeId
 The spec describing values of this field, if applicable.
GetStyle
 Gets the style of this field.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidCombinedParameters
 Checks if data is valid for combined parameters
ResetOverride
 Resets the override of this field.
SetCombinedParameters
 Sets this field's combine parameter array if applicable
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
SetStyle
 Sets the style of this field.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace